{
  "id": "bybit-hacker-case",
  "title": "Bybit Exchange Hack Investigation",
  "description": "Analysis of the June 2023 Bybit exchange security incident",
  "createdAt": "2023-07-15T10:30:00Z",
  "updatedAt": "2023-07-20T14:45:00Z",
  "notes": "# Bybit Exchange Hack Investigation\n\n## Executive Summary\n\nOn June 8, 2023, Bybit exchange experienced a security breach resulting in the unauthorized withdrawal of approximately $13.2 million in various cryptocurrencies. This report documents the investigation into the incident, tracking of stolen funds, and identification of potential suspects.\n\n## Timeline of Events\n\n- **June 8, 2023, 02:14 UTC**: First suspicious withdrawal detected from Bybit hot wallet\n- **June 8, 2023, 02:30 UTC**: Multiple large withdrawals observed within 16-minute window\n- **June 8, 2023, 03:45 UTC**: Bybit security team detected anomalies and froze remaining assets\n- **June 8, 2023, 04:30 UTC**: Bybit officially announced security incident on Twitter\n- **June 8, 2023, 08:00 UTC**: Exchange temporarily suspended all withdrawals\n- **June 9, 2023, 14:00 UTC**: Partial services restored with enhanced security measures\n\n## Addresses of Interest\n\n- **Attacker's Initial Address**: `0x28c6c06298d514db089934071355e5743bf21d60`\n- **Bybit Hot Wallet**: `0x5b82e3f6c68a0a7d57a9830d126081b2b7c41224`\n- **Tornado Cash Deposit Address**: `0x722122df12d4e14e13ac3b6895a86e84145b6967`\n- **Intermediary Wallet 1**: `0x9ad2f1978426e6c6a7e1d92073d9d618d47a0db7`\n- **Intermediary Wallet 2**: `0x4dd5752f7053922d13f4c6cce1f4f8f6204321ec`\n\n## Transactions of Interest\n\n- **Initial Theft Transaction**: `0x7d2d8f1d50e946e95e75d98c71b2a23e2e89704cfb291e1692ec1a2c5b879f7b`\n- **First Tornado Cash Deposit**: `0x9e2f96c8c5e590e3e7e0c3a3c19238bf1a072c5481396d3fb77da8c10f9b8fe9`\n- **Cross-Chain Bridge Transaction**: `0x1d5b64c2e7b8c703d7550583a9d52a0a0d3c9e8c9b8f05a9a5d3e5e67a1e7d8f`\n\n## Contracts of Interest\n\n- **Tornado Cash (100 ETH)**: `0x910cbd523d972eb0a6f4cae4618ad62622b39dbf`\n- **Tornado Cash (10 ETH)**: `0xa160cdab225685da1d56aa342ad8841c3b53f291`\n- **Uniswap V3 Router**: `0xe592427a0aece92de3edee1f18e0157c05861564`\n\n## Incident Overview\n\nThe attack appears to have been executed through a combination of social engineering and exploitation of private key management vulnerabilities. The attacker gained access to one of Bybit's hot wallet private keys, enabling them to initiate unauthorized withdrawals.\n\nThe stolen funds were primarily in ETH, USDT, and USDC, with smaller amounts in other tokens. Within hours of the theft, the attacker began laundering the funds through the following methods:\n\n1. Conversion of various tokens to ETH using Uniswap\n2. Deposits into Tornado Cash in batches of 100 ETH and 10 ETH\n3. Cross-chain transfers to Binance Smart Chain and Arbitrum\n4. Use of multiple intermediary wallets to obfuscate the trail\n\n## Technical Data\n\n### Stolen Assets Breakdown\n- ETH: 2,457 (~$4.5M)\n- USDT: 5.2M\n- USDC: 3.4M\n- Other tokens: ~$100K\n\n### Laundering Pattern Analysis\nThe attacker followed a sophisticated laundering pattern:\n\n```\nBybit Hot Wallet → Attacker's Initial Address → Token Swaps → \nIntermediary Wallets → Tornado Cash/Cross-chain Bridges\n```\n\nAnalysis of gas prices and transaction timing suggests the attacker used automated scripts to quickly move and launder funds, with transactions occurring in predictable intervals of 4-6 minutes.\n\n### Code Signatures\nExamination of the attacker's contract interactions shows similarities to previous exchange hacks, particularly in the method of interacting with Tornado Cash and the specific parameters used for Uniswap trades.\n\n## Conclusion\n\nThe investigation indicates this was a targeted attack by a sophisticated threat actor with deep knowledge of DeFi protocols and laundering techniques. The speed and methodology suggest possible connections to known North Korean Lazarus Group tactics.\n\nApproximately 60% of the stolen funds have been traced to Tornado Cash deposits, with the remaining 40% moved to other chains or still being tracked. Recovery prospects are limited due to the use of mixing services, though some exchanges have flagged addresses associated with the attack.\n\nBybit has since implemented additional security measures, including multi-party computation for wallet signing and enhanced anomaly detection systems.\n\n### Recommendations\n1. Continue monitoring flagged addresses for any movement\n2. Coordinate with other exchanges to identify any cash-out attempts\n3. Analyze similar attack patterns across other exchange incidents for potential attribution\n4. Review and enhance private key management protocols for all exchanges"
}